asayler/SmartWallv1/Slave-PIC32/Microchip/Smart Card/SClib.c
/********************************************************************
 FileName:		SClib.c
 Dependencies:	See INCLUDES section
 Processor:		PIC18,PIC24,PIC32 & dsPIC33F Microcontrollers
 Hardware:		This demo is natively intended to be used on Exp 16, LPC
 				& HPC Exp board. This demo can be modified for use on other hardware
 				platforms.
 Complier:  	Microchip C18 (for PIC18), C30 (for PIC24 & dsPIC) & C32 (for PIC32) 
 Company:		Microchip Technology, Inc.

 Software License Agreement:

 The software supplied herewith by Microchip Technology Incorporated
 (the “Company”) for its PIC® Microcontroller is intended and
 supplied to you, the Company’s customer, for use solely and
 exclusively on Microchip PIC Microcontroller products. The
 software is owned by the Company and/or its supplier, and is
 protected under applicable copyright laws. All rights are reserved.
 Any use in violation of the foregoing restrictions may subject the
 user to criminal sanctions under applicable laws, as well as to
 civil liability for the breach of the terms and conditions of this
 license.

 THIS SOFTWARE IS PROVIDED IN AN “AS IS” CONDITION. NO WARRANTIES,
 WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING, BUT NOT LIMITED
 TO, IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A
 PARTICULAR PURPOSE APPLY TO THIS SOFTWARE. THE COMPANY SHALL NOT,
 IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL OR
 CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.

********************************************************************
 File Description:

 Change History:
  Rev   Description
  ----  -----------------------------------------
  1.0   Initial release
  1.01  Cleaned up unnecessary variables,supported T=1 protocol
        and improvments in T=0 functions following the coding standards
  1.02  Disciplined the code. No functional changes made.
********************************************************************/

#include <string.h>
#include "./Smart Card/SClib.h"
#include "sc_config.h"

#if defined(__PIC24F__) || defined(__PIC24H__)
	#include "./Smart Card/SCpic24.h"
#elif defined(__PIC32MX__)
	#include "./Smart Card/SCpic32.h"
#elif defined(__dsPIC33F__)
	#include "./Smart Card/SCdspic33f.h"
#else
	#ifdef __18CXX
	#include "./Smart Card/SCpic18.h"
	#else
	#error "Only PIC18 and PIC24F currently supported by SmartCard Library"
	#endif
#endif

#define MAX_ATR_LEN			(BYTE)33

BYTE scCardATR[MAX_ATR_LEN];
BYTE scATRLength = 0;

BYTE scTA1, scTA2, scTA3;
BYTE scTB1, scTB2, scTB3;
BYTE scTC1, scTC2, scTC3;
BYTE scTD1, scTD2, scTD3;

BYTE* scATR_HistoryBuffer = NULL;
BYTE  scATR_HistoryLength = 0;

typedef enum
{
	UNKNOWN,
	ATR_ON
} SC_STATUS;

SC_STATUS gCardState = UNKNOWN;
SC_ERROR scLastError = SC_ERR_NONE;

// Work Wait time for T=0 Protocol in units of etu's
unsigned long cgt;
unsigned long t0WWTetu;
unsigned long t0WWT;	

static void SC_WaitTime(void);

#ifdef SC_PROTO_T1

	#define R_BLOCK_IDENTIFIER		(BYTE)0x80
	#define S_BLOCK_IDENTIFIER		(BYTE)0xC0
	#define M_BIT_SET				(BYTE)0x20
	#define M_BIT_CLR				(BYTE)0xDF
	#define S_BIT_SET				(BYTE)0x40
	#define S_BIT_CLR				(BYTE)0xBF
	#define S_BIT_POSITION			(BYTE)0x40

	unsigned long t1BWT;
	unsigned long t1CWT;
	unsigned long t1BGT;
	unsigned int t1BWTetu;
	unsigned int t1CWTetu;

	BYTE t1BGTetu = 22;

	BYTE edcType = SC_LRC_TYPE_EDC;
	BYTE maxSegmentLength = 0x20;
	BOOL txSbit = TRUE;

	static WORD SC_UpdateCRC(BYTE data,WORD crc);
	static void SC_UpdateEDC(BYTE data,WORD *edc);
	static void SC_SendT1Block(BYTE nad,BYTE pcb,WORD length,BYTE *buffer);
	static BOOL SC_ReceiveT1Block(BYTE *rxNAD,BYTE *rxPCB,BYTE *rxLength,BYTE *buffer,unsigned long blockWaitTime);

#endif

// Character Guard Time for T=0 & T=1 Protocol
BYTE cgtETU;

// CLA set to '00' = no command chaining, 
//                   no secure messaging, 
//					 basic logical channel.

/*******************************************************************************
  Function:
    void SC_Initialize(void)
	
  Description:
    This function initializes the smart card library

  Precondition:
    None

  Parameters:
    None

  Return Values:
    None
	
  Remarks:
    None
  *****************************************************************************/
void SC_Initialize()
{
	//Initialize the low level driver
	SCdrv_InitUART();
}

/*******************************************************************************
  Function:
	BOOL SC_CardPresent(void)	
  
  Description:
    This macro checks if card is inserted in the socket

  Precondition:
    SC_Initialize() is called

  Parameters:
    None

  Return Values:
    TRUE if Card is inserted, otherwise return FALSE
	
  Remarks:
    None
  *****************************************************************************/
BOOL SC_CardPresent()
{
	return SCdrv_CardPresent();
}	

/*******************************************************************************
  Function:
	BOOL SC_PowerOnATR(void)	
  
  Description:
    This function performs the power on sequence of the SmartCard and 
	interprets the Answer-to-Reset data received from the card.

  Precondition:
    SC_Initialize() is called, and card is present

  Parameters:
    None

  Return Values:
    TRUE if Answer to Reset (ATR) was successfuly received and processed
	
  Remarks:
    None
  *****************************************************************************/
BOOL SC_PowerOnATR()
{
	unsigned long atrDelayCnt;

	if( !SCdrv_CardPresent() )  //check card present
	{
		gCardState = UNKNOWN;
		return FALSE;
	}
		
	SCdrv_SetSwitchCardReset(0);  //make sure card in reset
	memset( scCardATR, 0xFF, sizeof scCardATR );
	WaitMilliSec(2);	

	#ifdef ENABLE_SC_POWER_THROUGH_PORT_PIN
		SCdrv_SetSwitchCardPower(1);	//Turn on power
	#endif

	scATR_HistoryLength = 0;
	scATR_HistoryBuffer = NULL;
	gCardState = UNKNOWN;
	scLastError = SC_ERR_NONE;
	scATRLength = 0;
//	t0WWT = (9600UL * (FCY/baudRate))/4;
	
