asayler/SmartWallv1/Slave-PIC32/Microchip/Smart Card/SClib.c
	// Wait count for maximum of 40,000 to 45,000 smard card clock cycles 
	// to get an ATR from card
	atrDelayCnt = 40000UL * (FCY/scReferenceClock);
	
	WaitMilliSec(2);

	SCdrv_EnableUART();

	WaitMilliSec(2);

	//Start the clock
	SCdrv_EnableClock();	

	// Wait for atleast 400 Clock Cycles after applying reference clock to card.
	WaitMilliSec(2);

	SCdrv_SetSwitchCardReset(1);  //Release card reset line. set to high state

	while(1)  ///////////////// Read Answer to RESET
	{
		if( SCdrv_GetRxData( &scCardATR[scATRLength], atrDelayCnt ) ) //wait for data byte from CARD
		{
			scATRLength++;

			if( scATRLength == MAX_ATR_LEN )
				break;
//			else
//				atrDelayCnt = t0WWT;
		}
		else
			break;	//no data
	}
		
	//decode the ATR values
	if( scATRLength >= 3 ) //min TS, T0 and setup byte
	{
		BYTE T0 = scCardATR[1];	
		BYTE atrIdx = 2;
		
		//Extract Interface bytes TAx TBx TCx and TDx from ATR
		
		scTA1 = scTB1 = scTC1 = scTD1 = 0;
		scTA2 = scTB2 = scTC2 = scTD2 = 0;
		scTA3 = scTB3 = scTC3 = scTD3 = 0;
		
		// Read the global interface bytes
		
		if( T0 & 0x10 )
			scTA1 = scCardATR[atrIdx++];
			
		if( T0 & 0x20 )
			scTB1 = scCardATR[atrIdx++];
			
		if( T0 & 0x40 )
			scTC1 = scCardATR[atrIdx++];

		if( T0 & 0x80 )
			scTD1 = scCardATR[atrIdx++];
			
		//read the next set of interface bytes if present
		if( scTD1 & 0xF0 )
		{
			if( scTD1 & 0x10 )
				scTA2 = scCardATR[atrIdx++];
				
			if( scTD1 & 0x20 )
				scTB2 = scCardATR[atrIdx++];
				
			if( scTD1 & 0x40 )
				scTC2 = scCardATR[atrIdx++];
				
			if( scTD1 & 0x80 )
				scTD2 = scCardATR[atrIdx++];
				
			if( scTD2 & 0xF0 )
			{
				if( scTD2 & 0x10 )
				{
					scTA3 = scCardATR[atrIdx++];
					
					if ((scTA3 < 0x10) || (scTA3 == 0xFF))
					{
						SC_Shutdown();
						scLastError = SC_ERR_ATR_DATA;
						return FALSE;
					}

					#ifdef SC_PROTO_T1
						maxSegmentLength = scTA3;
					#endif
				}

				if( scTD2 & 0x20 )
					scTB3 = scCardATR[atrIdx++];
					
				if( scTD2 & 0x40 )
				{
					scTC3 = scCardATR[atrIdx++];

					#ifdef SC_PROTO_T1
						edcType = (scTC3 & 0x01) ? SC_CRC_TYPE_EDC : SC_LRC_TYPE_EDC;
					#endif
				}

				if( scTD2 & 0x80 )
					scTD3 = scCardATR[atrIdx++];				
			}
		}
		
		scATR_HistoryLength = T0 & 0x0F;
		scATR_HistoryBuffer = (scATR_HistoryLength)?(&scCardATR[atrIdx]):NULL;
		SC_WaitTime();
		gCardState = ATR_ON;
		return TRUE;
	}
	else
	{
		// Not a Valid ATR Reponse
		scLastError = SC_ERR_BAR_OR_NO_ATR_RESPONSE;
		gCardState = UNKNOWN;	
		SC_Shutdown();	
		return FALSE;
	}	
}


/*******************************************************************************
  Function:
	BOOL SC_DoPPS(void)	
  
  Description:
    This function does the PPS to the card & configures the baud rate of the PIC UART
	to match with Answer-to-Reset data from smartcard.

  Precondition:
    SC_PowerOnATR was success

  Parameters:
    None

  Return Values:
    TRUE if Baud rate is supported by the PIC
	
  Remarks:
    This function is called when SC_PowerOnATR() returns TRUE.  If the Baud 
	rate configration file inside the card is changed, these function should 
	be called again for the new baud to take effect.
  *****************************************************************************/
BOOL SC_DoPPS()
{
	if( !SCdrv_CardPresent() || gCardState != ATR_ON )
		return FALSE;
	
	if( scTA1 == 0x11 )	//card using 9600 baud.  no need to configure
		return TRUE;

	// If TA2 is absent & TD1 is present
	if(!(scTD1 & 0x10) && (scCardATR[1] & 0x80) && !(scTD1 & 0x0F))	
	{
		SCdrv_SendTxData( 0xFF ); // PPSS Byte = 0xFF always

		if(scCardATR[1] & 0x10)
		{	
			SCdrv_SendTxData( 0x10 );	// PPS0
			SCdrv_SendTxData( scTA1 );	// PPS1
			SCdrv_SendTxData( 0xFF ^ 0x10 ^ scTA1 );	// PCK

			SCdrv_SetBRG( scTA1 );	//tell the driver to configure baud rate
			SC_WaitTime();
		}
		else
		{
			SCdrv_SendTxData( 0x00 );	// PPS0
			SCdrv_SendTxData( 0xFF);	// PCK
		}		
	}

	return TRUE;
}

/*******************************************************************************
  Function:
    int SC_GetCardState(void)
	
  Description:
    This function returns the current state of SmartCard

  Precondition:
    SC_Initialize is called.

  Parameters:
    None

  Return Values:
    SC_STATE_CARD_NOT_PRESENT:		No Card Detected
    SC_STATE_CARD_ACTIVE:			Card is powered and ATR received
    SC_STATE_CARD_INACTIVE:			Card present but not powered
	
  Remarks:
    None
  *****************************************************************************/
int SC_GetCardState()
{
	if( !SCdrv_CardPresent() )
		return SC_STATE_CARD_NOT_PRESENT;
	else if( gCardState == ATR_ON )
		return SC_STATE_CARD_ACTIVE;
	else
		return SC_STATE_CARD_INACTIVE;
}		

/*******************************************************************************
  Function:
    void SC_Shutdown(void)
	
  Description:
    This function Performs the Power Down sequence of the SmartCard

  Precondition:
    SC_Initialize is called.

  Parameters:
    None

  Return Values:
    None
	
  Remarks:
    None
  *****************************************************************************/
void SC_Shutdown()
{
	SCdrv_SetSwitchCardReset(0);	//bring reset line low
	WaitMilliSec(1);
	SCdrv_CloseUART();			//shut down UART and remove any pullups
	#ifdef ENABLE_SC_POWER_THROUGH_PORT_PIN
		SCdrv_SetSwitchCardPower(0);   //Turn Off Card Power
	#endif
	gCardState = UNKNOWN;
}


/*******************************************************************************
  Function:
    void SC_WaitTime(void)
	
  Description:
    This function calculates the work wait time for T=0 Protocol

  Precondition:
    SC_PowerOnATR is called.

  Parameters:
    None

  Return Values:
    None
	
  Remarks:
    This function is planned to calculate CWT & BWT for T=1 protocol in future.
  *****************************************************************************/
static void SC_WaitTime(void)
{
	BYTE ta1Code,tb2Code,index;
	BYTE tempVariable1;
	unsigned int tempVariable2 = 1;
	
