asayler/SmartWallv1/Slave-PIC32/Microchip/Smart Card/SClib.c
	ta1Code = scTA1 & 0x0F;

	factorDNumerator = 1;
	factorDdenominator = 1;

	// Calculate Factor 'D' from TA1 value
	switch(ta1Code)
	{
		case 0x00:
		case 0x07:
		case 0x01:
					break;

		case 0x02:
					factorDNumerator = 2;
					break;

		case 0x03:
					factorDNumerator = 4;
					break;

		case 0x04:
					factorDNumerator = 8;
					break;

		case 0x05:
					factorDNumerator = 16;
					break;

		case 0x06:
					factorDNumerator = 32;
					break;

		case 0x08:
					factorDNumerator = 12;
					break;

		case 0x09:
					factorDNumerator = 20;
					break;

		case 0x0A:
					factorDdenominator = 2;
					break;

		case 0x0B:
					factorDdenominator = 4;
					break;

		case 0x0C:
					factorDdenominator = 8;
					break;

		case 0x0D:
					factorDdenominator = 16;
					break;

		case 0x0E:
					factorDdenominator = 32;
					break;

		case 0x0F:
					factorDdenominator = 64;
					break;
	}

	ta1Code = (scTA1 & 0xF0) >> 4;
		
	// Calculate Factor 'F' from TA1 value
	switch(ta1Code)
	{
		case 0x00:
		case 0x07:
		case 0x08:
		case 0x0E:
		case 0x0F:
					break;
	
		case 0x01:
					factorF = 372;
					break;
	
		case 0x02:
					factorF = 558;
					break;

		case 0x03:
					factorF = 744;
					break;
	
		case 0x04:
					factorF = 1116;
					break;
	
		case 0x05:
					factorF = 1488;
					break;
	
		case 0x06:
					factorF = 1860;
					break;
	
		case 0x09:
					factorF = 512;
					break;
	
		case 0x0A:
					factorF = 768;
					break;
	
		case 0x0B:
					factorF = 1024;
					break;
	
		case 0x0C:
					factorF = 1536;
					break;
	
		case 0x0D:
					factorF = 2048;
					break;	
	}
	
	if(scTC1 != 0xFF)
	{
		cgtETU = 12 + (BYTE)((unsigned long)((unsigned long)(factorF * (unsigned long)factorDdenominator * scTC1)/factorDNumerator)/scReferenceClock);
	}

	// Check whether T=0 or T=1 protocol ?
	switch(scTD1 & 0x0F)
	{
		case 1 :
					// Calculate Character Guard Time in ETU's for T=1 Protocol
					if(scTC1 == 0xFF)
					{
						cgtETU = (BYTE)11;
					}
		
					#ifdef SC_PROTO_T1

						if(scTD1 & 0x20)
						{
							tb2Code = scTB2 & 0x0F;
						
							tempVariable1 = (scTB2 & 0xF0) >> 4;
						}
						else
						{
							tb2Code = SC_CWI;

							tempVariable1 = SC_BWI;

						}

						for(index = 0;index < tb2Code;index++)
							tempVariable2 = tempVariable2 * 2;

						// Calculate Character Wait Time in ETU's for T=1 Protocol as set in the card
						t1CWTetu = 11 + tempVariable2;
						
						tempVariable2 = 1;

						for(index = 0;index < tempVariable1;index++)
							tempVariable2 = tempVariable2 * 2;

						// Calculate Block Wait Time in ETU's for T=1 Protocol as set in the card						
						t1BWTetu = 11 + (unsigned int)((unsigned long)(tempVariable2 * 35712UL)/(scReferenceClock/10));
					
					#endif

					break;
		case 0 :
		default :

					// Calculate Character Guard Time in ETU's for T=1 Protocol		
					if(scTC1 == 0xFF)
					{
						cgtETU = (BYTE)12;
					}

					// If scTC2 is transmitted by the card then calculate work wait time
					// or else use default value
					if(scTD1 & 0x40)
					{
						tempVariable1 = scTC2;
					}
					else
					{
						tempVariable1 = SC_WI;
					}

					t0WWTetu = (unsigned long)(tempVariable1 * (unsigned long)factorDNumerator * 960)/factorDdenominator;

					break;
	}

	// Calculate Character Guard Time in number of Instruction Counts for T=0/T=1 Protocol		
	cgt = cgtETU * (FCY/baudRate);

	// Calculate Work Wait Time in number of Instruction Counts for T=0 Protocol
	t0WWT = t0WWTetu * (FCY/baudRate);

	#ifdef SC_PROTO_T1

		// Calculate Character Wait Time in number of Instruction Counts for T=1 Protocol
		t1CWT = t1CWTetu * (FCY/baudRate);

		// Calculate Block Guard Time in number of Instruction Counts for T=1 Protocol
		t1BGT = t1BGTetu * (FCY/baudRate);

		// Calculate Block Wait Time in number of Instruction Counts for T=1 Protocol
		t1BWT = t1BWTetu * (FCY/baudRate);

	#endif
}	

/*******************************************************************************
  Function:
	BOOL SC_TransactT0(SC_APDU_COMMAND* apduCommand, SC_APDU_RESPONSE* apduResponse, BYTE* apduDataBuffer)	
  
  Description:
    This function Sends the ISO 7816-4 compaliant APDU commands to the card.  
	It also receive the expected response from the card as defined by the 
	command data.

  Precondition:
    SC_DoPPS was success

  Parameters:
    SC_APDU_COMMAND* apduCommand	- Pointer to APDU Command Structure 
	SC_APDU_RESPONSE* pResp - Pointer to APDU Response structure
			BYTE* pResp - Pointer to the Command/Response Data buffer

  Return Values:
    TRUE if transaction was success, and followed the ISO 7816-4 protocol. 
	
  Remarks:
    In the APDU command structure, the LC field defines the number of bytes to 
	transmit from the APDUdat array.  This array can hold max 256 bytes, which 
	can be redefined by the user.  The LE field in APDU command defines the number
	of bytes to receive from the card.  This array can hold max 256 bytes, which 
	can be redefined by the user.
	
  *****************************************************************************/
BOOL SC_TransactT0(SC_APDU_COMMAND* apduCommand, SC_APDU_RESPONSE* apduResponse, BYTE* apduDataBuffer)
{
	BYTE* apduCommandBuffer;
	BYTE index,lc = apduCommand->LC,le = apduCommand->LE,ins = apduCommand->INS;
	BYTE rx_char;
	BYTE lcLength = 0,leLength = 0;
	unsigned int txDelay;

	// Return False if there is no Card inserted in the Slot
	if( !SCdrv_CardPresent() || gCardState != ATR_ON )
	{
		scLastError = SC_ERR_CARD_NOT_PRESENT;
		return FALSE;	
	}	

	// Clear APDU Response data if present before getting the new one's
	memset( apduResponse, 0, sizeof(SC_APDU_RESPONSE) );
	
	apduCommandBuffer = (BYTE*)apduCommand;
	
	txDelay = cgt/8;

	//Send the Command Bytes: CLA INS P1 P2
	for( index = 0; index < 4; index++ )
	{
		SCdrv_SendTxData( apduCommandBuffer[index] );
		SC_Delay(txDelay);
	}	
	
	//Now transmit LE or LC field if non zero
	if( lc )
		SCdrv_SendTxData( lc );
	else if( le )
		SCdrv_SendTxData( le );

	while (1)
	{
    	// Get Procedure byte
		if(!SCdrv_GetRxData( &rx_char, t0WWT ) ) //wait for data byte from CARD
		{
			scLastError = SC_ERR_CARD_NO_RESPONSE;
			return FALSE;	//no response received
		}	

