asayler/SmartWallv1/Slave-PIC32/Microchip/Smart Card/SClib.c
		// Process Procedure Byte
		if (rx_char == 0x60)
		{
			// Do Nothing
    	}
    	else if (((rx_char & 0xF0) == 0x60) || ((rx_char & 0xF0) == 0x90))
    	{
      		// SW1, get SW2
			apduResponse->SW1 = rx_char; //save SW1
			
			//now receive SW2
			if( SCdrv_GetRxData( &rx_char, t0WWT ) ) //wait for data byte from CARD
				apduResponse->SW2 = rx_char;
			else
			{
				scLastError = SC_ERR_CARD_NO_RESPONSE;
				return FALSE;	//no response received
			}

			break;
    	}
		else if(rx_char == ins)
		{
			// Send all remaining bytes
			if( lcLength < lc)		//transmit app data if any
			{
				WaitMicroSec( 700 );	//cannot send the message data right away after the initial response
				SC_Delay(txDelay);

				for(;lcLength < lc; lcLength++ )
				{	
					SCdrv_SendTxData( apduDataBuffer[lcLength] );
					SC_Delay(txDelay);
				}
			}
			else
			{
				// Recive all remaining bytes
				for(;leLength < le; leLength++ )
				{	
					if( SCdrv_GetRxData( &rx_char, t0WWT ) ) //wait for data byte from CARD
						apduDataBuffer[leLength] = rx_char;	
					else
					{
						scLastError = SC_ERR_CARD_NO_RESPONSE;
						return FALSE;	//no response received
					}
				}		
			}
		}
		else if(rx_char == ~ins)
		{
        	// ACK, send one byte if remaining
    		if (lcLength < lc)
      		{
				SC_Delay(txDelay);

				SCdrv_SendTxData( apduDataBuffer[lcLength++] );
      		}
      		else
      		{
				//wait for data byte from CARD or timeout
				if( SCdrv_GetRxData( &rx_char, t0WWT ) ) 
					apduDataBuffer[leLength++] = rx_char;	
				else
				{
					scLastError = SC_ERR_CARD_NO_RESPONSE;
					return FALSE;	//no response received
				}
			}
		}
		else
		{
			// Do Nothing
		}
	}

	// Store the number of recieved data bytes other than the
	// status codes to make the life of Smart Card Reader easier
	apduResponse->RXDATALEN = leLength;

	return TRUE;
}

#ifdef SC_PROTO_T1

/*******************************************************************************
  Function:
    void SC_UpdateCRC(void)
	
  Description:
    This function calculates 16 bit CRC for T=1 Protocol

  Precondition:
    Initial value of crc should be 0xFFFF.

  Parameters:
    BYTE data - Data that has to be used to update CRC.
	WORD *edc - Pointer to CRC

  Return Values:
    WORD - updated CRC
	
  Remarks:
    CRC 16 - X^16 + X^12 + X^5 + 1

  *****************************************************************************/
static WORD SC_UpdateCRC(BYTE data,WORD crc)
{
	WORD index;
	WORD tempData = (WORD)data << 8;

	// Update the CRC & return it Back
	for (index = 0;index < 8;index++)
	{
		if ((crc ^ tempData) & 0x8000)
		{
			crc <<= 1;
			crc ^= (WORD)0x1021; // X^12 + X^5 + 1
		}
		else
		{
			crc <<= 1;
		}
		
		tempData <<= 1;
	}
	
	return(crc);
}

/*******************************************************************************
  Function:
    void SC_UpdateEDC(BYTE data,WORD *edc)
	
  Description:
    This function updates Error Data Check value depending on the EDC type
    for T=1 Protocol

  Precondition:
    None.

  Parameters:
    BYTE data - Data that has to be used to update EDC.
	WORD *edc - Pointer to EDC

  Return Values:
    None
	
  Remarks:
    None

*****************************************************************************/
static void SC_UpdateEDC(BYTE data,WORD *edc)
{
	// Store the updated LRC/CRC in the EDC
	if (edcType == SC_CRC_TYPE_EDC)	// type = CRC
	{
		*edc = SC_UpdateCRC(data,*edc);
	}
	else // type = LRC
	{
		*edc = *edc ^ data;
	}
}

/*******************************************************************************
  Function:
    static void SC_SendT1Block(BYTE nad,BYTE pcb,WORD length,BYTE *buffer)
	
  Description:
    This function transmits a T=1 formatted block

  Precondition:
    Complete ATR...

  Parameters:
    BYTE nad - NAD to be transmitted to the card
    BYTE pcb - PCB to be transmitted to the card
    WORD length - Length of I-Field transmitted to the card
    BYTE *buffer - Pointer to data that is to be transmitted to the card

  Return Values:
    None
	
  Remarks:
    None

*****************************************************************************/
static void SC_SendT1Block(BYTE nad,BYTE pcb,WORD length,BYTE *buffer)
{
	WORD index;
	WORD edc;

	// Choose the initial value of edc depending upon LRC or CRC
	if (edcType == SC_CRC_TYPE_EDC)
	{
		edc = 0xFFFF;
	}
	else
	{
		edc = 0;
	}
	// Update the edc for Node Address Data Byte
	SC_UpdateEDC(nad,&edc);

	// Update the edc for Protocol Control Byte
	SC_UpdateEDC(pcb,&edc);

	// Update the edc for length of tx Bytes
	SC_UpdateEDC(length,&edc);

	// Update the edc for the data to be transmitted
	for (index=0;index<length;index++)
	{
		SC_UpdateEDC(buffer[index],&edc);
	}

	// Transmit Node Address
	SCdrv_SendTxData(nad);

	// Transmit Protocol Control Byte	
	SCdrv_SendTxData(pcb);

	// Transmit length of Data Byte	
	SCdrv_SendTxData(length);

	// Transmit Data Bytes
	for (index=0;index<length;index++)
	{
		SCdrv_SendTxData(buffer[index]);
	}

	// Transmit EDC
	if (edcType == SC_LRC_TYPE_EDC)
	{
		SCdrv_SendTxData(edc);
	}
	else
	{
		SCdrv_SendTxData(edc);
	    SCdrv_SendTxData(edc>>8);
	}
}

/*******************************************************************************
  Function:
    void SC_ReceiveT1Block(void)
	
  Description:
    This function receives a T=1 formatted block

  Precondition:
    Transmit a block before expecting the response...

  Parameters:
    BYTE *rxNAD - Pointer to NAD recieved from the card
    BYTE *rxPCB - Pointer to PCB recieved from the card
    BYTE *rxLength - Pointer to Length of I-Field recieved from the card
    BYTE *buffer - Pointer to data recieved from the card
	unsigned long blockWaitTime - value of Block Wait Time

  Return Values:
    TRUE if block recieve is successful, and follows the ISO 7816-4 protocol. 
	
