asayler/SmartWallv1/Slave-PIC32/Microchip/Smart Card/SClib.c
  Remarks:
    None
*****************************************************************************/
static BOOL SC_ReceiveT1Block(BYTE *rxNAD,BYTE *rxPCB,BYTE *rxLength,BYTE *buffer,unsigned long blockWaitTime)
{
	WORD edc;
	WORD index;
	BYTE expectedLength;

  	// Get NAD
	if(!SCdrv_GetRxData( rxNAD, blockWaitTime ))
	{
		scLastError = SC_ERR_CARD_NO_RESPONSE;
		return FALSE;
	}

  	// Get PCB
	if(!SCdrv_GetRxData( rxPCB, t1CWT ))
	{
		scLastError = SC_ERR_CARD_NO_RESPONSE;
		return FALSE;
	}

  	// Get Length	
	if(!SCdrv_GetRxData( rxLength, t1CWT ))
	{
		scLastError = SC_ERR_CARD_NO_RESPONSE;
		return FALSE;
	}

	// Add one to the expected length for LRC
	expectedLength = *rxLength + 1;

	// Add additional byte to the length if using CRC
	if (edcType == SC_CRC_TYPE_EDC)
		expectedLength++;

	// Get all the data bytes plus EDC (1 or 2 bytes at end)
	for (index = 0;index < expectedLength;)
	{
		if(!SCdrv_GetRxData( buffer + index, t1CWT ))
		{
			scLastError = SC_ERR_CARD_NO_RESPONSE;
			return FALSE;
		}
		
		++index;
	}

	// Check the LRC or CRC Error
	if (edcType == SC_LRC_TYPE_EDC)
	{
		edc = 0;
		SC_UpdateEDC(*rxNAD,&edc);
		SC_UpdateEDC(*rxPCB,&edc);
		SC_UpdateEDC(*rxLength,&edc);
		for (index = 0;index < expectedLength;)
		{
			SC_UpdateEDC(*(buffer + index),&edc);
			++index;
		}

		if (edc != 0)
		{
			scLastError = SC_ERR_RECEIVE_LRC;
			return FALSE;
		}
	}
	else // EDC is CRC
	{
		edc = 0xFFFF;
		SC_UpdateEDC(*rxNAD,&edc);
		SC_UpdateEDC(*rxPCB,&edc);
		SC_UpdateEDC(*rxLength,&edc);
		for (index = 0;index < (expectedLength-2);)
		{
			SC_UpdateEDC(*(buffer + index),&edc);
			++index;
		}

		if (((edc >> 8) != buffer[expectedLength-2]) || ((edc & 0xFF) != buffer[expectedLength-1]))
	    {
			scLastError = SC_ERR_RECEIVE_CRC;
			return FALSE;
		}
	}
	
	// Return TRUE if there is no LRC or CRC error & data bytes are recieved sucessfully
	return TRUE;
}

/*******************************************************************************
  Function:
	BOOL SC_TransactT1(SC_T1_PROLOGUE_FIELD* pfield,BYTE* iField,SC_APDU_RESPONSE* apduResponse)
  
  Description:
    This function Sends the ISO 7816-4 compaliant APDU commands to the card.  
	It also receive the expected response from the card as defined by the 
	command data.

  Precondition:
    SC_DoPPS was success

  Parameters:
    SC_T1_PROLOGUE_FIELD* pfield - Pointer to Prologue Field 
	BYTE* iField - Pointer to the Information Field of Tx/Rx Data
	SC_APDU_RESPONSE* apduResponse - Pointer to APDU Response structure

  Return Values:
    TRUE if transaction was success, and followed the ISO 7816-4 protocol. 
	
  Remarks:    	
  *****************************************************************************/

BOOL SC_TransactT1(SC_T1_PROLOGUE_FIELD* pfield,BYTE* iField,SC_APDU_RESPONSE* apduResponse)
{
	BOOL	t1TransactCompleted = FALSE,txMbit = FALSE;
	BOOL	rxMbit = FALSE,rxSbit = FALSE,transmitNextSegment = TRUE;
	BYTE	txLength,txPCB = pfield->PCB,rxNAD,rxPCB,rxLEN;
	BYTE	initialLength = pfield->LENGTH,iFieldLength,retryR = 0,retrySync = 0;
	WORD	rxLength = 0;
	BYTE*	rxField = iField;
	BYTE*	txField = iField;
	BYTE*	initialField = iField;
	unsigned long currT1BWT = t1BWT;
	T1BLOCK_TYPE t1TxBlockType,currentT1RxBlockType;

	iFieldLength = initialLength;

	// Determine which type of block is to be transmitted to the card
	if((txPCB & 0x80) == 0x00)
	{
		// I-Block
		t1TxBlockType = I_BLOCK;

		if(txSbit)
		{
			txPCB = txPCB & S_BIT_CLR;
			txSbit = FALSE;
		}
		else
		{
			txPCB = txPCB | S_BIT_SET;
			txSbit = TRUE;
		}
	}
	else if((txPCB & 0xC0) == 0xC0)
	{
		// S-Block
		t1TxBlockType = S_BLOCK;
	}
	else if((txPCB & 0xC0) == 0x80)
	{
		// R-Block
		t1TxBlockType = R_BLOCK;
	}
	else
	{
		// INVALID BLOCK
		return FALSE;
	}

	// Go to appropriate case depending upon the type of block
	switch(t1TxBlockType)
	{
		case	I_BLOCK:
							// Continue Untill Transaction is Passed or Failed...
							while (!t1TransactCompleted)
							{
								// If Next segment has to be transmitted to the card
								if(transmitNextSegment)
								{
									txMbit = FALSE;

									if(iFieldLength > maxSegmentLength)
									{
										txLength = maxSegmentLength;
										txMbit = TRUE;
										txPCB = txPCB | M_BIT_SET;
									}
									else
									{
										txLength = iFieldLength;
										txPCB = txPCB & M_BIT_CLR;
									}
								
									txField = iField;
								}

								// Send block with chaining mode, current sequence number, and maximum length.
								SC_SendT1Block(pfield->NAD,txPCB,txLength,txField);
								
								// Recieve the Block
								if(SC_ReceiveT1Block(&rxNAD,&rxPCB,&rxLEN,rxField,currT1BWT))
								{
									// Determine the type of Block recieved from the card
									if((rxPCB & 0x80) == 0x00)
									{
										// I-Block
										currentT1RxBlockType = I_BLOCK;
										
										if((rxPCB & 0x20) == 0x20)
											rxMbit = TRUE;
										else
											rxMbit = FALSE;

										if((rxPCB & 0x40) == 0x40)
											rxSbit = TRUE;
										else
											rxSbit = FALSE;

										transmitNextSegment = FALSE;
										
										retryR = 0;retrySync = 0;
									}
									else if((rxPCB & 0xC0) == 0xC0)
									{
										// S-Block
										currentT1RxBlockType = S_BLOCK;
										
										retryR = 0;retrySync = 0;
									}
									else if((rxPCB & 0xC0) == 0x80)
									{
										// R-Block
										currentT1RxBlockType = R_BLOCK;
										
										retryR = 0;retrySync = 0;
									}
									else
									{
										// INVALID BLOCK
										currentT1RxBlockType = INVALID_BLOCK;
									}
								}
								else
								{
									// No Block Recieved or Error Block Recieved
									currentT1RxBlockType = INVALID_BLOCK;
								}
						
