asayler/SmartWallv1/Slave-PIC32/Microchip/Smart Card/SClib.c
								currT1BWT = t1BWT;
								
								switch(currentT1RxBlockType)
								{
									case	I_BLOCK	:
														rxField = rxField + (BYTE)rxLEN;
														rxLength = rxLength + rxLEN;
														iFieldLength = 0;

														// If More Bit is set by the card,
														// send the apprpriate R Block
														if(rxMbit)
														{
															// Transmit R(N) - Expected Seq
															txLength = 0x00;
															
															if(rxSbit)
																txPCB = 0x80;
															else
																txPCB = 0x90;
														}
														else
														{
															// No More Bit set from the card,
															// Data is recieved with the status
															// codes...we are done
															if(rxLEN)
															{
																// We are Done here
																t1TransactCompleted = TRUE;
																if(rxLength >= 2)
																{
																	apduResponse->RXDATALEN = rxLength - 2;
																	apduResponse->SW1 = *(initialField + (BYTE)rxLength - (BYTE)2);
																	apduResponse->SW2 = *(initialField + (BYTE)rxLength - (BYTE)1);
																}
															}
															else
															{
																// Transmit Forced Acknowledge I Block
																txLength = 0x00;
															
																if(txSbit)
																{
																	txPCB = 0x00;
																	txSbit = FALSE;
																}
																else
																{
																	txPCB = 0x40;
																	txSbit = TRUE;
																}
															}
														}

														break;

									case	S_BLOCK	:
														// Card can only send Resync Response...
														// Card cant do Resync request
														if((rxPCB & 0x3F) == 0x20) // Resync Response from the card
														{
															txSbit = FALSE;
															return FALSE;
														}
														else if((rxPCB & 0x3F) == 0x01) // Request IFS Change
														{
															txPCB = SC_IFS_RESPONSE;
															txLength = 1;
															txField = rxField;
															maxSegmentLength = *rxField;
															transmitNextSegment = FALSE;
															continue;
														}
														else if((rxPCB & 0x3F) == 0x03) // Request Wait time Extension
														{
															currT1BWT = t1BWT * *rxField;
															txPCB = SC_WAIT_TIME_EXT_RESPONSE;
															txLength = 1;
															txField = rxField;
															transmitNextSegment = FALSE;
															continue;
														}
														else if((rxPCB & 0x3F) == 0x24) // VPP Error Response
														{
															scLastError = SC_CARD_VPP_ERR;
															return FALSE;
														}
														else if((rxPCB & 0x3F) == 0x02) // Abort Request
														{
															txPCB = SC_ABORT_RESPONSE;
															txLength = 0;
															if(txMbit)
															{
																// Do this so that there is last byte transmission to terminate
																// the communication
																iFieldLength = maxSegmentLength + 1;
															}
															transmitNextSegment = FALSE;
															continue;
														}
														break;

									case	R_BLOCK	:
														// If Recieved Seq Number not equal
														// to transmitted Seq Number
														if(rxSbit != txSbit)
														{
															// If More Bit is set by the reader
															if(txMbit)
															{
																// Transmission of previous segment was
																// succesful. Transmit next segment.
																transmitNextSegment = TRUE;

																iFieldLength = iFieldLength - maxSegmentLength;
																iField = iField + maxSegmentLength;

																// Toggle the Sequence Bit
																if(txSbit)
																{
																	txPCB = 0x00;
																	txSbit = FALSE;
																}
																else
																{
																	txPCB = 0x40;
																	txSbit = TRUE;
																}
															}
															else
															{
																// There was some error, trasmit previous
																// block
																transmitNextSegment = FALSE;
															}
														}
														else
														{
															// Retransmit the I-Block
															transmitNextSegment = TRUE;
														}
														
														break;

									case	INVALID_BLOCK	:
																// If 1st Block transaction itself 
																// is failing transmit R(0)
																if(initialLength == iFieldLength)
																{
																	txPCB = 0x82;
																	txLength = 0x00;
																	transmitNextSegment = FALSE;
																	retryR++;
																	retrySync = 0;

																	// Try transmitting R(0) twice
																	// before telling error to the
																	// Smart Card Reader
																	if(retryR > 2)
																	{
																		scLastError = SC_ERR_CARD_NO_RESPONSE;
																		return FALSE;
																	}
																}
																else
																{
																	transmitNextSegment = FALSE;
																	
																	// Try transmitting R(0) twice																															// Try transmitting R(0) twice
																	// before transmitting ReSync
																	// Request to the card
																	if(retryR < 2)
																	{
																		if(rxMbit)
																			txPCB = 0x82;
																		else
																			txPCB = 0x92;
																	
																		txLength = 0x00;
																		retryR++;
																		retrySync = 0;
																	}
																	else
																	{
																		txPCB = 0xC0;
																		txLength = 0x00;
																		retrySync++;
																																		// Try transmitting R(0) twice																															// Try transmitting R(0) twice
																		// Try transmitting Resync Request
																		// thrice before telling error to the
																		// Smart Card Reader
																		if(retrySync > 3)
																		{
																			scLastError = SC_ERR_CARD_NO_RESPONSE;
																			return FALSE;
																		}
																	}
																}
																
																continue;
																
																break;
								}
							}	
							
							break;

		case	S_BLOCK:
							// Continue Untill Transaction is Passed or Failed...
							while (!t1TransactCompleted)
							{
								// Send mode, current sequence number, and maximum length.
								SC_SendT1Block(pfield->NAD,txPCB,0,txField);

								// Recieve the Block	
								if(SC_ReceiveT1Block(&rxNAD,&rxPCB,&rxLEN,rxField,currT1BWT))
								{
									// Determine the type of Block recieved from the card
									if((rxPCB & 0x80) == 0x00)
									{
										// I-Block
										currentT1RxBlockType = I_BLOCK;
									}
									else if((rxPCB & 0xC0) == 0xC0)
									{
										// S-Block
										currentT1RxBlockType = S_BLOCK;
									}
									else if((rxPCB & 0xC0) == 0x80)
									{
										// R-Block
										currentT1RxBlockType = R_BLOCK;
									}
									else
									{
										// INVALID BLOCK
										currentT1RxBlockType = INVALID_BLOCK;
									}
								}
								else
								{
									// No Block Recieved or Error Block Recieved
									currentT1RxBlockType = INVALID_BLOCK;
								}
								
								switch(currentT1RxBlockType)
								{
									case	S_BLOCK	:
														// If Acknowledged properly, return 
														// TRUE to the card reader
														if((txPCB | 0x20) == rxPCB)
														{
															t1TransactCompleted = TRUE;
															break;
														}
														else
														{
															// Try transmitting thrice before
															// telling error to the Smart
															// Card Reader
															retrySync++;
															
															if(retrySync > 3)
															{
																scLastError = SC_ERR_CARD_NO_RESPONSE;
																return FALSE;
															}

															continue;
														}
														break;
									case	R_BLOCK	:
									case	I_BLOCK	:
									case	INVALID_BLOCK	:
															// Try transmitting thrice before
															// telling error to the Smart
															// Card Reader
															retrySync++;
															if(retrySync > 3)
															{
																scLastError = SC_ERR_CARD_NO_RESPONSE;
																return FALSE;
															}
															continue;
															break;
								}
							}
							break;
		
		case	R_BLOCK:
		default:
						break;
	}

	// Return TRUE if everything is fine
	return TRUE;
}

#endif

